leoembeddeder/stm32_example/App/Src/uds_bootloader.c
#include "uds_bootloader.h"

#if defined(USE_HAL_DRIVER) || defined(STM32F767xx) || defined(STM32C092xx)
#include "main.h"
#endif
#include <string.h>

/* Lightweight standalone SHA-256 implementation */
typedef struct {
    uint32_t state[8];
    uint64_t count;
    uint8_t buffer[64];
} Sha256Ctx;

#define ROR32(val, bits) (((val) >> (bits)) | ((val) << (32U - (bits))))
#define CH(x, y, z) (((x) & (y)) ^ (~(x) & (z)))
#define MAJ(x, y, z) (((x) & (y)) ^ ((x) & (z)) ^ ((y) & (z)))
#define EP0(x) (ROR32(x, 2U) ^ ROR32(x, 13U) ^ ROR32(x, 22U))
#define EP1(x) (ROR32(x, 6U) ^ ROR32(x, 11U) ^ ROR32(x, 25U))
#define SIG0(x) (ROR32(x, 7U) ^ ROR32(x, 18U) ^ ((x) >> 3U))
#define SIG1(x) (ROR32(x, 17U) ^ ROR32(x, 19U) ^ ((x) >> 10U))

static const uint32_t kSha256K[64] = {
    0x428a2f98UL, 0x71374491UL, 0xb5c0fbcfUL, 0xe9b5dba5UL, 0x3956c25bUL, 0x59f111f1UL,
    0x923f82a4UL, 0xab1c5ed5UL, 0xd807aa98UL, 0x12835b01UL, 0x243185beUL, 0x550c7dc3UL,
    0x72be5d74UL, 0x80deb1feUL, 0x9bdc06a7UL, 0xc19bf174UL, 0xe49b69c1UL, 0xefbe4786UL,
    0x0fc19dc6UL, 0x240ca1ccUL, 0x2de92c6fUL, 0x4a7484aaUL, 0x5cb0a9dcUL, 0x76f988daUL,
    0x983e5152UL, 0xa831c66dUL, 0xb00327c8UL, 0xbf597fc7UL, 0xc6e00bf3UL, 0xd5a79147UL,
    0x06ca6351UL, 0x14292967UL, 0x27b70a85UL, 0x2e1b2138UL, 0x4d2c6dfcUL, 0x53380d13UL,
    0x650a7354UL, 0x766a0abbUL, 0x81c2c92eUL, 0x92722c85UL, 0xa2bfe8a1UL, 0xa81a664bUL,
    0xc24b8b70UL, 0xc76c51a3UL, 0xd192e819UL, 0xd6990624UL, 0xf40e3585UL, 0x106aa070UL,
    0x19a4c116UL, 0x1e376c08UL, 0x2748774cUL, 0x34b0bcb5UL, 0x391c0cb3UL, 0x4ed8aa4aUL,
    0x5b9cca4fUL, 0x682e6ff3UL, 0x748f82eeUL, 0x78a5636fUL, 0x84c87814UL, 0x8cc70208UL,
    0x90befffaUL, 0xa4506cebUL, 0xbef9a3f7UL, 0xc67178f2UL};

static void sha256_transform(Sha256Ctx *ctx, const uint8_t *data) {
    uint32_t a = ctx->state[0];
    uint32_t b = ctx->state[1];
    uint32_t c = ctx->state[2];
    uint32_t d = ctx->state[3];
    uint32_t e = ctx->state[4];
    uint32_t f = ctx->state[5];
    uint32_t g = ctx->state[6];
    uint32_t h = ctx->state[7];
    uint32_t m[64];

    for (uint8_t i = 0U; i < 16U; ++i) {
        m[i] = ((uint32_t)data[i * 4U] << 24U) | ((uint32_t)data[i * 4U + 1U] << 16U) |
               ((uint32_t)data[i * 4U + 2U] << 8U) | (uint32_t)data[i * 4U + 3U];
    }
    for (uint8_t i = 16U; i < 64U; ++i) {
        m[i] = SIG1(m[i - 2U]) + m[i - 7U] + SIG0(m[i - 15U]) + m[i - 16U];
    }
    for (uint8_t i = 0U; i < 64U; ++i) {
        uint32_t t1 = h + EP1(e) + CH(e, f, g) + kSha256K[i] + m[i];
        uint32_t t2 = EP0(a) + MAJ(a, b, c);
        h = g;
        g = f;
        f = e;
        e = d + t1;
        d = c;
        c = b;
        b = a;
        a = t1 + t2;
    }
    ctx->state[0] += a;
    ctx->state[1] += b;
    ctx->state[2] += c;
    ctx->state[3] += d;
    ctx->state[4] += e;
    ctx->state[5] += f;
    ctx->state[6] += g;
    ctx->state[7] += h;
}

static void sha256_init(Sha256Ctx *ctx) {
    ctx->state[0] = 0x6a09e667UL;
    ctx->state[1] = 0xbb67ae85UL;
    ctx->state[2] = 0x3c6ef372UL;
    ctx->state[3] = 0xa54ff53aUL;
    ctx->state[4] = 0x510e527fUL;
    ctx->state[5] = 0x9b05688cUL;
    ctx->state[6] = 0x1f83d9abUL;
    ctx->state[7] = 0x5be0cd19UL;
    ctx->count = 0U;
}

static void sha256_update(Sha256Ctx *ctx, const uint8_t *data, size_t len) {
    size_t buffer_idx = (size_t)(ctx->count & 0x3FU);
    ctx->count += len;
    for (size_t i = 0U; i < len; ++i) {
        ctx->buffer[buffer_idx++] = data[i];
        if (buffer_idx == 64U) {
            sha256_transform(ctx, ctx->buffer);
            buffer_idx = 0U;
        }
    }
}

static void sha256_final(Sha256Ctx *ctx, uint8_t *digest) {
    uint64_t total_bits = ctx->count * 8U;
    size_t buffer_idx = (size_t)(ctx->count & 0x3FU);
    ctx->buffer[buffer_idx++] = 0x80U;

    if (buffer_idx > 56U) {
        (void)memset(&ctx->buffer[buffer_idx], 0, 64U - buffer_idx);
        sha256_transform(ctx, ctx->buffer);
        buffer_idx = 0U;
    }
    (void)memset(&ctx->buffer[buffer_idx], 0, 56U - buffer_idx);
    for (uint8_t i = 0U; i < 8U; ++i) {
        ctx->buffer[56U + i] = (uint8_t)((total_bits >> (56U - i * 8U)) & 0xFFU);
    }
    sha256_transform(ctx, ctx->buffer);

    for (uint8_t i = 0U; i < 8U; ++i) {
        digest[i * 4U] = (uint8_t)((ctx->state[i] >> 24U) & 0xFFU);
        digest[i * 4U + 1U] = (uint8_t)((ctx->state[i] >> 16U) & 0xFFU);
        digest[i * 4U + 2U] = (uint8_t)((ctx->state[i] >> 8U) & 0xFFU);
        digest[i * 4U + 3U] = (uint8_t)(ctx->state[i] & 0xFFU);
    }
}

static UdsBootloaderContext s_bl_ctx;
static UdsDownloadMemoryMap s_bl_memory_map;
static UdsDownload s_bl_download;

#if !defined(HAL_FLASH_MODULE_ENABLED)
#define UDS_BL_MOCK_FLASH_SIZE 4096U
static uint8_t s_mock_flash_slot_a[UDS_BL_MOCK_FLASH_SIZE];
static uint8_t s_mock_flash_slot_b[UDS_BL_MOCK_FLASH_SIZE];
static uint32_t s_mock_flash_slot_a_len = 0U;
static uint32_t s_mock_flash_slot_b_len = 0U;
#endif

static uint32_t bootloader_calc_crc32(const uint8_t *data, uint32_t length) {
    uint32_t value = 0xFFFFFFFFUL;
    if (data == NULL) {
        return 0U;
    }
    for (uint32_t index = 0U; index < length; ++index) {
        value ^= data[index];
        for (uint8_t bit = 0U; bit < 8U; ++bit) {
            value = ((value & 1U) != 0U) ? ((value >> 1U) ^ 0xEDB88320UL) : (value >> 1U);
        }
    }
    return value ^ 0xFFFFFFFFUL;
}

static UdsDownloadResult bootloader_flash_erase_start(void *context, uint32_t address,
                                                      uint32_t length) {
    (void)context;
    (void)address;
    (void)length;
#if defined(HAL_FLASH_MODULE_ENABLED)
#if defined(STM32F767xx)
    HAL_FLASH_Unlock();
    FLASH_EraseInitTypeDef erase_init;
    erase_init.TypeErase = FLASH_TYPEERASE_SECTORS;
    erase_init.Sector = FLASH_SECTOR_8; /* Start of Bank 2 Slot B */
    erase_init.NbSectors = 4U;          /* Sectors 8 to 11 (1024 KB) */
    erase_init.VoltageRange = FLASH_VOLTAGE_RANGE_3;
    uint32_t sector_error = 0U;
    if (HAL_FLASHEx_Erase(&erase_init, &sector_error) != HAL_OK) {
        HAL_FLASH_Lock();
        return UDS_DOWNLOAD_ERASE_ERROR;
    }
    HAL_FLASH_Lock();
#elif defined(STM32C092xx) || defined(STM32C0xx)
    HAL_FLASH_Unlock();
    __HAL_FLASH_CLEAR_FLAG(FLASH_FLAG_ALL_ERRORS);
    uint32_t page_index = (address - 0x08000000U) / 2048U;
    uint32_t nb_pages = (length + 2047U) / 2048U;
    FLASH_EraseInitTypeDef erase_init;
    (void)memset(&erase_init, 0, sizeof(erase_init));
    erase_init.TypeErase = FLASH_TYPEERASE_PAGES;
    erase_init.Page = page_index;
    erase_init.NbPages = nb_pages;
    uint32_t page_error = 0U;
    if (HAL_FLASHEx_Erase(&erase_init, &page_error) != HAL_OK) {
        HAL_FLASH_Lock();
        return UDS_DOWNLOAD_ERASE_ERROR;
    }
    HAL_FLASH_Lock();
#endif
#else
    if (address >= s_bl_ctx.target_slot_addr) {
        s_mock_flash_slot_b_len = 0U;
        (void)memset(s_mock_flash_slot_b, 0xFF, sizeof(s_mock_flash_slot_b));
    } else {
        s_mock_flash_slot_a_len = 0U;
        (void)memset(s_mock_flash_slot_a, 0xFF, sizeof(s_mock_flash_slot_a));
    }
#endif
    return UDS_DOWNLOAD_OK;
}

static UdsDownloadResult bootloader_flash_erase_poll(void *context) {
    (void)context;
#if defined(HAL_FLASH_MODULE_ENABLED)
#if defined(STM32F767xx)
    if (__HAL_FLASH_GET_FLAG(FLASH_FLAG_BSY)) {
        return UDS_DOWNLOAD_BUSY;
    }
    if (__HAL_FLASH_GET_FLAG(FLASH_FLAG_OPERR | FLASH_FLAG_WRPERR | FLASH_FLAG_PGAERR |
                             FLASH_FLAG_PGPERR | FLASH_FLAG_ERSERR)) {
        __HAL_FLASH_CLEAR_FLAG(FLASH_FLAG_OPERR | FLASH_FLAG_WRPERR | FLASH_FLAG_PGAERR |
                               FLASH_FLAG_PGPERR | FLASH_FLAG_ERSERR);
        HAL_FLASH_Lock();
        return UDS_DOWNLOAD_ERASE_ERROR;
    }
    HAL_FLASH_Lock();
#elif defined(STM32C092xx) || defined(STM32C0xx)
    if (__HAL_FLASH_GET_FLAG(FLASH_FLAG_BSY)) {
        return UDS_DOWNLOAD_BUSY;
    }
#if defined(FLASH_FLAG_ALL_ERRORS)
    if (__HAL_FLASH_GET_FLAG(FLASH_FLAG_ALL_ERRORS)) {
        __HAL_FLASH_CLEAR_FLAG(FLASH_FLAG_ALL_ERRORS);
        HAL_FLASH_Lock();
        return UDS_DOWNLOAD_ERASE_ERROR;
    }
#else
    uint32_t err_flags = FLASH_FLAG_OPERR | FLASH_FLAG_PROGERR | FLASH_FLAG_WRPERR |
                         FLASH_FLAG_PGAERR | FLASH_FLAG_SIZERR | FLASH_FLAG_PGSERR |
                         FLASH_FLAG_FASTERR;
#if defined(FLASH_FLAG_MISSERR)
    err_flags |= FLASH_FLAG_MISSERR;
#endif
    if (__HAL_FLASH_GET_FLAG(err_flags)) {
        __HAL_FLASH_CLEAR_FLAG(err_flags);
        HAL_FLASH_Lock();
        return UDS_DOWNLOAD_ERASE_ERROR;
    }
#endif
    HAL_FLASH_Lock();
#endif
#endif
    return (s_bl_ctx.last_erase_result == 0x00U) ? UDS_DOWNLOAD_OK : UDS_DOWNLOAD_ERASE_ERROR;
}

