leoembeddeder/stm32_example/App/Src/uds_bootloader.c
static UdsDownloadResult bootloader_flash_program(void *context, uint32_t address,
                                                  const uint8_t *data, uint16_t length) {
    (void)context;
#if defined(HAL_FLASH_MODULE_ENABLED)
    HAL_FLASH_Unlock();
#if defined(STM32F767xx)
    for (uint32_t i = 0U; i < (uint32_t)length; i += 4U) {
        uint32_t word = 0xFFFFFFFFUL;
        size_t chunk_len = ((uint32_t)length - i < 4U) ? (size_t)((uint32_t)length - i) : 4U;
        (void)memcpy(&word, &data[i], chunk_len);
        if (HAL_FLASH_Program(FLASH_TYPEPROGRAM_WORD, address + i, (uint64_t)word) != HAL_OK) {
            HAL_FLASH_Lock();
            return UDS_DOWNLOAD_PROGRAM_ERROR;
        }
    }
#elif defined(STM32C092xx) || defined(STM32C0xx)
    __HAL_FLASH_CLEAR_FLAG(FLASH_FLAG_ALL_ERRORS);
    size_t i = 0U;
    while ((i + 8U) <= (size_t)length) {
        uint64_t dword_val = 0U;
        (void)memcpy(&dword_val, &data[i], 8U);
        if (HAL_FLASH_Program(FLASH_TYPEPROGRAM_DOUBLEWORD, address + i, dword_val) != HAL_OK) {
            HAL_FLASH_Lock();
            return UDS_DOWNLOAD_PROGRAM_ERROR;
        }
        i += 8U;
    }
    if (i < (size_t)length) {
        uint64_t dword_val = 0xFFFFFFFFFFFFFFFFULL;
        (void)memcpy(&dword_val, &data[i], (size_t)length - i);
        if (HAL_FLASH_Program(FLASH_TYPEPROGRAM_DOUBLEWORD, address + i, dword_val) != HAL_OK) {
            HAL_FLASH_Lock();
            return UDS_DOWNLOAD_PROGRAM_ERROR;
        }
    }
#endif
    HAL_FLASH_Lock();
#else
    if ((data != NULL) && (length > 0U)) {
        if (address >= s_bl_ctx.target_slot_addr) {
            uint32_t offset = address - s_bl_ctx.target_slot_addr;
            if ((offset + (uint32_t)length) <= sizeof(s_mock_flash_slot_b)) {
                (void)memcpy(&s_mock_flash_slot_b[offset], data, (size_t)length);
                if ((offset + (uint32_t)length) > s_mock_flash_slot_b_len) {
                    s_mock_flash_slot_b_len = offset + (uint32_t)length;
                }
            }
        } else {
            uint32_t offset =
                (address >= s_bl_ctx.active_slot_addr) ? (address - s_bl_ctx.active_slot_addr) : 0U;
            if ((offset + (uint32_t)length) <= sizeof(s_mock_flash_slot_a)) {
                (void)memcpy(&s_mock_flash_slot_a[offset], data, (size_t)length);
                if ((offset + (uint32_t)length) > s_mock_flash_slot_a_len) {
                    s_mock_flash_slot_a_len = offset + (uint32_t)length;
                }
            }
        }
    }
#endif
    return UDS_DOWNLOAD_OK;
}

static UdsDownloadResult bootloader_flash_verify(void *context, const UdsDownloadMetadata *metadata,
                                                 uint32_t expected_crc32, bool has_expected_crc32) {
    (void)context;
    if ((metadata == NULL) || (metadata->image_length == 0U)) {
        return UDS_DOWNLOAD_INVALID_ARGUMENT;
    }

    uint32_t computed_flash_crc = 0U;
#if defined(HAL_FLASH_MODULE_ENABLED)
    const uint8_t *flash_ptr = (const uint8_t *)(uintptr_t)metadata->image_address;
    computed_flash_crc = bootloader_calc_crc32(flash_ptr, metadata->image_length);
#else
    const uint8_t *mock_buf = (metadata->image_address >= s_bl_ctx.target_slot_addr)
                                  ? s_mock_flash_slot_b
                                  : s_mock_flash_slot_a;
    uint32_t mock_len = (metadata->image_address >= s_bl_ctx.target_slot_addr)
                            ? s_mock_flash_slot_b_len
                            : s_mock_flash_slot_a_len;
    if ((mock_len > 0U) && (mock_len >= metadata->image_length)) {
        computed_flash_crc = bootloader_calc_crc32(mock_buf, metadata->image_length);
    } else {
        computed_flash_crc = metadata->crc32 ^ 0xFFFFFFFFUL;
    }
#endif

    if (has_expected_crc32) {
        if (computed_flash_crc != expected_crc32) {
            return UDS_DOWNLOAD_VERIFY_ERROR;
        }
    } else {
        if ((metadata->crc32 != 0xFFFFFFFFUL) &&
            (computed_flash_crc != (metadata->crc32 ^ 0xFFFFFFFFUL))) {
            return UDS_DOWNLOAD_VERIFY_ERROR;
        }
    }

    return UDS_DOWNLOAD_OK;
}

UdsDownloadResult uds_bootloader_flash_verify(const UdsDownloadMetadata *metadata,
                                              uint32_t expected_crc32, bool has_expected_crc32) {
    return bootloader_flash_verify(NULL, metadata, expected_crc32, has_expected_crc32);
}

UdsDownloadResult uds_bootloader_flash_erase_poll(void) {
    return bootloader_flash_erase_poll(NULL);
}

UdsDownloadResult uds_bootloader_activate_candidate(void) {
    if (!s_bl_ctx.candidate_verified) {
        return UDS_DOWNLOAD_SEQUENCE_ERROR;
    }

    if (s_bl_ctx.target == UDS_BL_TARGET_STM32C092) {
        uint32_t image_size = s_bl_ctx.staging_metadata.image_size;
        if ((image_size == 0U) || (image_size > s_bl_ctx.active_slot_size)) {
            return UDS_DOWNLOAD_OUT_OF_RANGE;
        }

        uint32_t slot_a_addr = s_bl_ctx.active_slot_addr;

        /* 1. Erase Slot A for the candidate image size */
        UdsDownloadResult erase_res = bootloader_flash_erase_start(NULL, slot_a_addr, image_size);
        if (erase_res != UDS_DOWNLOAD_OK) {
            return erase_res;
        }
        UdsDownloadResult poll_res = bootloader_flash_erase_poll(NULL);
        if (poll_res != UDS_DOWNLOAD_OK) {
            return poll_res;
        }

        /* 2. Copy candidate image from Slot B to Slot A */
#if defined(HAL_FLASH_MODULE_ENABLED)
        uint32_t slot_b_addr = s_bl_ctx.target_slot_addr;
        const uint8_t *src = (const uint8_t *)(uintptr_t)slot_b_addr;
        uint32_t bytes_written = 0U;
        while (bytes_written < image_size) {
            uint16_t chunk_len = ((image_size - bytes_written) > 256U)
                                     ? 256U
                                     : (uint16_t)(image_size - bytes_written);
            UdsDownloadResult prog_res = bootloader_flash_program(NULL, slot_a_addr + bytes_written,
                                                                  &src[bytes_written], chunk_len);
            if (prog_res != UDS_DOWNLOAD_OK) {
                return prog_res;
            }
            bytes_written += chunk_len;
        }

