leoembeddeder/stm32_example/App/Src/uds_bootloader.c
        /* 3. Read back from Slot A and verify CRC32 */
        const uint8_t *dest = (const uint8_t *)(uintptr_t)slot_a_addr;
        uint32_t flash_crc = bootloader_calc_crc32(dest, image_size);
        if ((s_bl_ctx.staging_metadata.crc32 != 0U) &&
            (flash_crc != s_bl_ctx.staging_metadata.crc32)) {
            return UDS_DOWNLOAD_VERIFY_ERROR;
        }
#else
        uint32_t copy_len = (image_size > sizeof(s_mock_flash_slot_b))
                                ? (uint32_t)sizeof(s_mock_flash_slot_b)
                                : image_size;
        UdsDownloadResult prog_res =
            bootloader_flash_program(NULL, slot_a_addr, s_mock_flash_slot_b, (uint16_t)copy_len);
        if (prog_res != UDS_DOWNLOAD_OK) {
            return prog_res;
        }

        uint32_t flash_crc = bootloader_calc_crc32(s_mock_flash_slot_a, copy_len);
        if ((s_bl_ctx.staging_metadata.crc32 != 0U) &&
            (flash_crc != s_bl_ctx.staging_metadata.crc32)) {
            return UDS_DOWNLOAD_VERIFY_ERROR;
        }
#endif
    }

    /* 4. Update active version and slot status */
    s_bl_ctx.active_version = s_bl_ctx.staging_metadata.version;
    s_bl_ctx.staging_metadata.status = (uint8_t)UDS_BL_SLOT_ACTIVE;
    s_bl_ctx.candidate_verified = false;
    return UDS_DOWNLOAD_OK;
}

void uds_bootloader_set_target(UdsBootloaderTarget target) {
    s_bl_ctx.target = target;
    s_bl_ctx.active_version = 1U;
    s_bl_ctx.download_in_progress = false;
    s_bl_ctx.candidate_verified = false;
    s_bl_ctx.last_erase_result = 0x00U;
    s_bl_ctx.last_check_memory_result = 0x01U;
    s_bl_ctx.last_check_dependencies_result = 0x01U;
    (void)memset(&s_bl_ctx.staging_metadata, 0, sizeof(s_bl_ctx.staging_metadata));

    if (target == UDS_BL_TARGET_STM32C092) {
        s_bl_ctx.active_slot_addr = UDS_BL_C092_APP_SLOT_A_START;
        s_bl_ctx.active_slot_size = UDS_BL_C092_APP_SLOT_A_SIZE;
        s_bl_ctx.target_slot_addr = UDS_BL_C092_APP_SLOT_B_START;
        s_bl_ctx.target_slot_size = UDS_BL_C092_APP_SLOT_B_SIZE;

        s_bl_memory_map.staging_image.start = UDS_BL_C092_APP_SLOT_B_START;
        s_bl_memory_map.staging_image.end_exclusive =
            UDS_BL_C092_APP_SLOT_B_START + UDS_BL_C092_APP_SLOT_B_SIZE;
        s_bl_memory_map.bootloader.start = UDS_BL_C092_BOOTLOADER_START;
        s_bl_memory_map.bootloader.end_exclusive =
            UDS_BL_C092_BOOTLOADER_START + UDS_BL_C092_BOOTLOADER_SIZE;
        s_bl_memory_map.active_application.start = UDS_BL_C092_APP_SLOT_A_START;
        s_bl_memory_map.active_application.end_exclusive =
            UDS_BL_C092_APP_SLOT_A_START + UDS_BL_C092_APP_SLOT_A_SIZE;
        s_bl_memory_map.persistent_storage.start = UDS_BL_C092_NVM_METADATA_START;
        s_bl_memory_map.persistent_storage.end_exclusive =
            UDS_BL_C092_NVM_METADATA_START + UDS_BL_C092_NVM_METADATA_SIZE;
        s_bl_memory_map.diagnostic_storage.start = UDS_BL_C092_NVM_METADATA_START;
        s_bl_memory_map.diagnostic_storage.end_exclusive =
            UDS_BL_C092_NVM_METADATA_START + UDS_BL_C092_NVM_METADATA_SIZE;
        s_bl_memory_map.erase_alignment = 8U;
        s_bl_memory_map.program_alignment = 8U;
        s_bl_memory_map.max_block_length = 256U;
        s_bl_memory_map.activation_supported = true;
    } else {
        s_bl_ctx.active_slot_addr = UDS_BL_F767_APP_SLOT_A_START;
        s_bl_ctx.active_slot_size = UDS_BL_F767_APP_SLOT_A_SIZE;
        s_bl_ctx.target_slot_addr = UDS_BL_F767_APP_SLOT_B_START;
        s_bl_ctx.target_slot_size = UDS_BL_F767_APP_SLOT_B_SIZE;

        s_bl_memory_map.staging_image.start = UDS_BL_F767_APP_SLOT_B_START;
        s_bl_memory_map.staging_image.end_exclusive =
            UDS_BL_F767_APP_SLOT_B_START + UDS_BL_F767_APP_SLOT_B_SIZE;
        s_bl_memory_map.bootloader.start = UDS_BL_F767_BOOTLOADER_START;
        s_bl_memory_map.bootloader.end_exclusive =
            UDS_BL_F767_BOOTLOADER_START + UDS_BL_F767_BOOTLOADER_SIZE;
        s_bl_memory_map.active_application.start = UDS_BL_F767_APP_SLOT_A_START;
        s_bl_memory_map.active_application.end_exclusive =
            UDS_BL_F767_APP_SLOT_A_START + UDS_BL_F767_APP_SLOT_A_SIZE;
        s_bl_memory_map.persistent_storage.start = UDS_BL_F767_NVM_METADATA_START;
        s_bl_memory_map.persistent_storage.end_exclusive =
            UDS_BL_F767_NVM_METADATA_START + 0x8000UL;
        s_bl_memory_map.diagnostic_storage.start = UDS_BL_F767_NVM_METADATA_START + 0x8000UL;
        s_bl_memory_map.diagnostic_storage.end_exclusive = UDS_BL_F767_APP_SLOT_A_START;
        s_bl_memory_map.erase_alignment = 4U;
        s_bl_memory_map.program_alignment = 4U;
        s_bl_memory_map.max_block_length = 256U;
        s_bl_memory_map.activation_supported = true;
    }

    UdsDownloadCallbacks dl_callbacks = {
        .erase_start = bootloader_flash_erase_start,
        .erase_poll = bootloader_flash_erase_poll,
        .program = bootloader_flash_program,
        .verify_image = bootloader_flash_verify,
        .abort = NULL,
        .watchdog_kick = NULL,
    };
    uds_download_init(&s_bl_download, &s_bl_memory_map, &dl_callbacks, &s_bl_ctx);
}

void uds_bootloader_init(void) {
#if defined(STM32C092xx) || defined(TARGET_STM32C092)
    uds_bootloader_set_target(UDS_BL_TARGET_STM32C092);
#else
    uds_bootloader_set_target(UDS_BL_TARGET_STM32F767);
#endif
}

UdsBootloaderTarget uds_bootloader_get_target(void) {
    return s_bl_ctx.target;
}

UdsDownloadMemoryMap uds_bootloader_get_memory_map(void) {
    return s_bl_memory_map;
}

uint32_t uds_bootloader_get_active_version(void) {
    return s_bl_ctx.active_version;
}

uint32_t uds_bootloader_get_active_slot(void) {
    return s_bl_ctx.active_slot_addr;
}

bool uds_bootloader_is_activation_pending(void) {
    return s_bl_ctx.candidate_verified;
}

/* Service 0x34: RequestDownload */
UdsCallbackResult uds_bootloader_request_download(void *context, uint32_t address, uint32_t length,
                                                  uint16_t *max_block_length) {
    (void)context;
    if (max_block_length == NULL) {
        return UDS_RESULT_ERROR;
    }
    /* Enforce boundary check: Address must target Slot B */
    if ((address < s_bl_ctx.target_slot_addr) ||
        ((address + length) > (s_bl_ctx.target_slot_addr + s_bl_ctx.target_slot_size))) {
        return UDS_RESULT_OUT_OF_RANGE;
    }
    UdsDownloadResult res = uds_download_begin(&s_bl_download, address, length, 0U);
    if (res != UDS_DOWNLOAD_OK) {
        return (res == UDS_DOWNLOAD_OUT_OF_RANGE) ? UDS_RESULT_OUT_OF_RANGE : UDS_RESULT_ERROR;
    }
    (void)uds_download_poll_erase(&s_bl_download, 0U);
    *max_block_length = s_bl_memory_map.max_block_length;
    s_bl_ctx.download_in_progress = true;
    s_bl_ctx.candidate_verified = false;
    return UDS_RESULT_OK;
}

/* Service 0x36: TransferData */
UdsCallbackResult uds_bootloader_transfer_data(void *context, uint8_t block_sequence,
                                               const uint8_t *data, uint16_t length) {
    (void)context;
    if (!s_bl_ctx.download_in_progress) {
        return UDS_RESULT_SEQUENCE_ERROR;
    }
    if (uds_download_state(&s_bl_download) == UDS_DOWNLOAD_ERASING) {
        (void)uds_download_poll_erase(&s_bl_download, 0U);
    }
    UdsDownloadResult res = uds_download_write(&s_bl_download, block_sequence, data, length, 0U);
    if (res != UDS_DOWNLOAD_OK) {
        return (res == UDS_DOWNLOAD_SEQUENCE_ERROR) ? UDS_RESULT_SEQUENCE_ERROR : UDS_RESULT_ERROR;
    }
    return UDS_RESULT_OK;
}

/* Service 0x37: RequestTransferExit */
UdsCallbackResult uds_bootloader_transfer_exit(void *context, const uint8_t *request,
                                               uint16_t request_len, uint8_t *response,
                                               uint16_t *response_len, uint16_t capacity) {
    (void)context;
    (void)capacity;
    if (!s_bl_ctx.download_in_progress) {
        return UDS_RESULT_SEQUENCE_ERROR;
    }
    uint32_t expected_crc = 0U;
    bool has_expected_crc = false;
    if ((request != NULL) && (request_len >= 4U)) {
        expected_crc = ((uint32_t)request[0] << 24U) | ((uint32_t)request[1] << 16U) |
                       ((uint32_t)request[2] << 8U) | (uint32_t)request[3];
        has_expected_crc = true;
    }
    UdsDownloadResult res = uds_download_finish(&s_bl_download, expected_crc, has_expected_crc, 0U);
    s_bl_ctx.download_in_progress = false;
    if (res != UDS_DOWNLOAD_OK) {
        uds_download_abort(&s_bl_download);
        return UDS_RESULT_ERROR;
    }
    if (response != NULL) {
        response[0] = 0x00U; /* Success status parameter */
    }
    if (response_len != NULL) {
        *response_len = 1U;
    }
    return UDS_RESULT_OK;
}

/* Service 0x31: RoutineControl (0xFF00 Erase, 0x0202 CheckMemory & Anti-Rollback) */
UdsCallbackResult uds_bootloader_routine_control(void *context, uint8_t subfunction,
                                                 uint16_t routine_id, const uint8_t *in,
                                                 uint16_t in_len, uint8_t *out, uint16_t *out_len,
                                                 uint16_t capacity) {
    (void)context;
    if (((subfunction != UDS_ROUTINE_SUBFUNCTION_START_ROUTINE) &&
         (subfunction != UDS_ROUTINE_SUBFUNCTION_REQUEST_RESULTS)) ||
        (out == NULL) || (out_len == NULL) || (capacity < 1U)) {
        return UDS_RESULT_OUT_OF_RANGE;
    }

    if (routine_id == UDS_BL_ROUTINE_ERASE_MEMORY) {
        if (subfunction == UDS_ROUTINE_SUBFUNCTION_REQUEST_RESULTS) {
            out[0] = s_bl_ctx.last_erase_result;
            *out_len = 1U;
            return UDS_RESULT_OK;
        }
        /* Routine 0xFF00: Erase Slot B */
        UdsDownloadResult res = bootloader_flash_erase_start(NULL, s_bl_ctx.target_slot_addr,
                                                             s_bl_ctx.target_slot_size);
        uint8_t status = (uint8_t)((res == UDS_DOWNLOAD_OK) ? 0x00U : 0x01U); /* 0x00 = success */
        s_bl_ctx.last_erase_result = status;
        out[0] = status;
        *out_len = 1U;
        return (res == UDS_DOWNLOAD_OK) ? UDS_RESULT_OK : UDS_RESULT_ERROR;
    }

