leoembeddeder/stm32_example/App/Src/uds_bootloader.c
    if (routine_id == UDS_BL_ROUTINE_CHECK_MEMORY) {
        if (subfunction == UDS_ROUTINE_SUBFUNCTION_REQUEST_RESULTS) {
            out[0] = s_bl_ctx.last_check_memory_result;
            *out_len = 1U;
            return UDS_RESULT_OK;
        }

        /* Routine 0x0202: Verify Checksum/Hash, Anti-Rollback, and Cryptographic Signature */
        const FirmwareMetadata_t *meta =
            (const FirmwareMetadata_t *)(uintptr_t)s_bl_ctx.target_slot_addr;
        FirmwareMetadata_t temp_meta;

        if (in_len >= sizeof(FirmwareMetadata_t)) {
            (void)memcpy(&temp_meta, in, sizeof(FirmwareMetadata_t));
            meta = &temp_meta;
        }

        /* 1. Magic check */
        if (meta->magic != UDS_BL_METADATA_MAGIC) {
            s_bl_ctx.last_check_memory_result = 0x01U;
            out[0] = 0x01U; /* Failed validation */
            *out_len = 1U;
            return UDS_RESULT_OUT_OF_RANGE;
        }

        /* 2. Anti-rollback check: Version must be >= currently active monotonic version */
        if (meta->version < s_bl_ctx.active_version) {
            s_bl_ctx.last_check_memory_result = 0x02U;
            out[0] = 0x02U; /* Rejected: Version downgrade attempt */
            *out_len = 1U;
            return UDS_RESULT_OUT_OF_RANGE;
        }

        /* 3. Compute SHA-256 over image */
        uint8_t computed_hash[32];
        Sha256Ctx sha;
        sha256_init(&sha);
        if (meta->image_size > sizeof(FirmwareMetadata_t)) {
            const uint8_t *payload = (const uint8_t *)(uintptr_t)(s_bl_ctx.target_slot_addr +
                                                                  sizeof(FirmwareMetadata_t));
            size_t payload_size = (size_t)(meta->image_size - sizeof(FirmwareMetadata_t));
            sha256_update(&sha, payload, payload_size);
        }
        sha256_final(&sha, computed_hash);

        /* 4. Match hash digest */
        if (memcmp(computed_hash, meta->sha256, sizeof(computed_hash)) != 0) {
            s_bl_ctx.last_check_memory_result = 0x03U;
            out[0] = 0x03U; /* Digest mismatch */
            *out_len = 1U;
            return UDS_RESULT_ERROR;
        }

        /* All checks passed: mark candidate verified and ready for activation */
        s_bl_ctx.staging_metadata = *meta;
        s_bl_ctx.candidate_verified = true;
        s_bl_ctx.last_check_memory_result = 0x00U;
        s_bl_ctx.last_check_dependencies_result = 0x00U;
        out[0] = 0x00U; /* 0x00 = Verification Passed */
        *out_len = 1U;
        return UDS_RESULT_OK;
    }

    if (routine_id == UDS_BL_ROUTINE_CHECK_DEPENDENCIES) {
        if (subfunction == UDS_ROUTINE_SUBFUNCTION_REQUEST_RESULTS) {
            out[0] = s_bl_ctx.last_check_dependencies_result;
            *out_len = 1U;
            return UDS_RESULT_OK;
        }

        /* Routine 0xFF01: Check Programming Dependencies (ISO 14229-1 / OEM Flashing) */
        bool dependencies_ok = s_bl_ctx.candidate_verified &&
                               (!s_bl_ctx.download_in_progress) &&
                               (s_bl_ctx.staging_metadata.magic == UDS_BL_METADATA_MAGIC);
#if defined(HAL_FLASH_MODULE_ENABLED)
        dependencies_ok = dependencies_ok &&
                          uds_bootloader_is_application_valid(s_bl_ctx.target_slot_addr);
#endif

        uint8_t status = (uint8_t)(dependencies_ok ? 0x00U : 0x01U); /* 0x00: dependencies satisfied */
        s_bl_ctx.last_check_dependencies_result = status;
        out[0] = status;
        *out_len = 1U;
        return dependencies_ok ? UDS_RESULT_OK : UDS_RESULT_DENIED;
    }

    return UDS_RESULT_NOT_SUPPORTED;
}

/* Vector Table Sanity Validation Gate (S32K144 / OpenBLT specification) */
bool uds_bootloader_is_application_valid(uint32_t app_vector_addr) {
    uint32_t flash_base = (s_bl_ctx.target == UDS_BL_TARGET_STM32C092) ? UDS_BL_C092_FLASH_BASE
                                                                       : UDS_BL_F767_FLASH_BASE;
    uint32_t flash_end = (s_bl_ctx.target == UDS_BL_TARGET_STM32C092)
                             ? (UDS_BL_C092_FLASH_BASE + UDS_BL_C092_FLASH_SIZE)
                             : (UDS_BL_F767_FLASH_BASE + UDS_BL_F767_FLASH_SIZE);
    uint32_t ram_start = (s_bl_ctx.target == UDS_BL_TARGET_STM32C092) ? UDS_BL_C092_RAM_START
                                                                      : UDS_BL_F767_RAM_START;
    uint32_t ram_end =
        (s_bl_ctx.target == UDS_BL_TARGET_STM32C092) ? UDS_BL_C092_RAM_END : UDS_BL_F767_RAM_END;

    if ((app_vector_addr < flash_base) || (app_vector_addr >= flash_end)) {
        return false;
    }

    /* Hardware VTOR alignment: 256-byte aligned on Cortex-M0+, 512-byte aligned on Cortex-M7 */
    uint32_t vtor_alignment_mask = (s_bl_ctx.target == UDS_BL_TARGET_STM32C092) ? 0xFFU : 0x1FFU;
    if ((app_vector_addr & vtor_alignment_mask) != 0U) {
        return false;
    }
    const uint32_t *vectors = (const uint32_t *)(uintptr_t)app_vector_addr;
    uint32_t initial_msp = vectors[0];
    uint32_t reset_handler = vectors[1];

    /* 1. Initial MSP must be in SRAM bounds and aligned */
    if ((initial_msp < ram_start) || (initial_msp > ram_end) || ((initial_msp & 0x3U) != 0U)) {
        return false;
    }

    /* 2. Reset Handler must have Thumb bit set and be non-erased */
    if (((reset_handler & 0x1U) == 0U) || (reset_handler == 0xFFFFFFFFUL)) {
        return false;
    }

    uint32_t reset_addr = reset_handler & ~1U;
    if ((reset_addr < app_vector_addr) || (reset_addr >= flash_end)) {
        return false;
    }
    return true;
}

typedef void (*AppEntryFn)(void);

/* Vector Jump, Barrier Synchronization & Cache Maintenance */
void uds_bootloader_jump_to_app(uint32_t app_vector_addr) {
#if defined(STM32C092xx) || defined(CORTEX_M0PLUS)
    /* Sanity gate: Validate vector table before attempting execution */
    if (!uds_bootloader_is_application_valid(app_vector_addr)) {
        return;
    }

    uint32_t app_msp = *(__IO uint32_t *)(uintptr_t)app_vector_addr;
    AppEntryFn app_entry =
        (AppEntryFn)(uintptr_t)(*(__IO uint32_t *)(uintptr_t)(app_vector_addr + 4U));

    /* 1. Disable all interrupts */
    __disable_irq();

    /* 2. Disable SysTick timer and clear pending register */
    SysTick->CTRL = 0U;
    SysTick->LOAD = 0U;
    SysTick->VAL = 0U;

    /* 3. Disable all peripherals & clear NVIC pending interrupts (single 32-bit register on Cortex-M0+) */
    NVIC->ICER[0] = 0xFFFFFFFFUL;
    NVIC->ICPR[0] = 0xFFFFFFFFUL;

    /* 4. Set Vector Table Offset Register (VTOR) */
    SCB->VTOR = app_vector_addr;

    /* 5. Reset CONTROL register to Privileged Thread Mode on MSP */
    __set_CONTROL(0U);

    /* 6. Memory Synchronization Barriers */
    __DSB();
    __ISB();

    /* 7. Set Main Stack Pointer and branch to reset handler */
    __set_MSP(app_msp);
    app_entry();
#elif defined(CORTEX_M7) || defined(STM32F767xx)
    /* Sanity gate: Validate vector table before attempting execution */
    if (!uds_bootloader_is_application_valid(app_vector_addr)) {
        return;
    }

    uint32_t app_msp = *(__IO uint32_t *)(uintptr_t)app_vector_addr;
    AppEntryFn app_entry =
        (AppEntryFn)(uintptr_t)(*(__IO uint32_t *)(uintptr_t)(app_vector_addr + 4U));

    /* 1. Disable all interrupts */
    __disable_irq();

    /* 2. Disable SysTick timer and clear pending register */
    SysTick->CTRL = 0U;
    SysTick->LOAD = 0U;
    SysTick->VAL = 0U;

    /* 3. Disable all peripherals & clear NVIC pending interrupts */
    for (uint32_t i = 0U; i < 8U; i++) {
        NVIC->ICER[i] = 0xFFFFFFFFUL;
        NVIC->ICPR[i] = 0xFFFFFFFFUL;
    }

    /* 4. Clear pending system exceptions (PendSV, SysTick) */
    SCB->ICSR = SCB_ICSR_PENDSTCLR_Msk | SCB_ICSR_PENDSVCLR_Msk;

    /* 5. Disable and clean Cortex-M7 L1 Caches */
    SCB_DisableICache();
    SCB_DisableDCache();
    SCB_InvalidateICache();
    SCB_CleanInvalidateDCache();

    /* 6. Set Vector Table Offset Register (VTOR) */
    SCB->VTOR = app_vector_addr;

    /* 7. Reset CONTROL register to Privileged Thread Mode on MSP */
    __set_CONTROL(0U);

    /* 8. Memory Synchronization Barriers */
    __DSB();
    __ISB();

    /* 9. Set Main Stack Pointer and branch to reset handler */
    __set_MSP(app_msp);
    app_entry();
#else
    (void)app_vector_addr;
#endif
}
